[
  {
    "id": "bursaries-various-youthvillage",
    "title": "Bursaries",
    "company": "Various Companies",
    "location": "South Africa",
    "description": "// <![CDATA[ var uri = 'http://imp.tradedoubler.com/imp?type(js)g(21441206)a(2327322)' + new String (Math.random()).substring (2, 11); document.write('<sc'+'ript type=\"text/javascript\" src=\"'+uri+'\" charset=\"ISO-8859-1\"></sc'+'ript>'); // ]]&gt; Alfred Nzo District Municipality: Bursaries 2014 Closing Date: 07 January 2014 Applications are hereby invited from suitably qualified persons for external bursary programme for 2014 Academic year. Alfred District Municipality bursary funds the following scarce and critical skills: BSc : Community Water Services and Sanitation, BSc Water Resource Management or any other water and sanitation related qualification Civil Engineering Town and Regional Planning Accounting /Financial Management Internal Auditing Environmental Management Environmental Health Management Geographic Information System Information Communication Technology / BSc Computer Science Conditions of Eligibility Preference will be given to disadvantaged individuals, and proof thereof must be provided. Students residing within Alfred Nzo area of jurisdiction Youth between ages 16-35 Students who are financially needy and academic deserving Students who are intending to study at a recognised South African tertiary institution for the aforementioned fields How to Apply Application forms are available from the website address: www.andm.gov.za Applicants should submit the following documents with the application forms: Motivation letter Grade 12 certificate or latest results for current grade 12 leaners Proof of enrolment or acceptance letter from recognised tertiary institution Certified copy of ID Proof of residence from Ward Councillor Parents proof of income/death certificate(s) affidavit in cases where the student does not have one or both parents. Applications must be submitted to: The Executive Manager Corporate Services, Alfred Nzo District Municipality, ERF 1400 Ntsizwa Street, Private Bag X 511, Mount Ayliff 4735. All queries should be directed to Ms. N. Mabunzi: Human Resource Development Section by telephone on (039) 254 5112. Successful students are expected to enter into a contractual agreement with Alfred Nzo District Municipality. The agreement contains all general provisions related to the bursary. Alfred Nzo District Municipality reserves the right to determine the total number of bursary allocations for the academic year based on the total budget available. Successful candidates will be informed on or before 15 January 2014. var uri = 'http://imp.tradedoubler.com/imp?type(img)g(21247562)a(2327322)' + new String (Math.random()).substring (2, 11); document.write('<a href=\"http://clk.tradedoubler.com/click?p=220091&#038;a=2327322&#038;g=21247562\" target=\"_BLANK\"><img decoding=\"async\" src=\"'+uri+'\" border=0></a>'); WRSETA: Bursary Programme 2014 Closing Date: 30 November 2013 The Wholesale and Retail SETA (W&RSETA) is offering bursaries for the second consecutive year to learners who have successfully completed W&RSETA Learnerships at NQF level 2, 3, 4 or 5 and who want to register to further their studies at public Higher Education Institutions. The W&RSETA has identified as one of its strategic objectives the need to support learners who have successfully completed W&RSETA Learnerships by offering them bursaries to further their studies thus addressing Outcome 4.2.3. of the National Skills Development Strategy which is to ensure that high-level national Scarce Skills are being addressed by work-ready graduates from Higher Education Institutions Learners must have completed the W&RSETA’s NQF 2, 3, 4 or 5 Learnerships and could either be employed or unemployed. The W&RSETA has made available 1000 bursaries to: 500 employed learners and 500 unemployed learners. The programme is for full-time or part-time studies at any public South African University. The duration of the qualification should not exceed 3 years. Learners who will be accepted by their preferred public South African University This Bursary is restricted to learners who enroll for qualifications related to the Wholesale and Retail Sector and which seek to address any of the following Scarce Skills identified in the W&R Sector Skills Plan: Retail Management; Food and Beverage Scientist Operations Management Purchasing Management (Buyers and Planners); Financial Management Financial Business Analyst Bookkeeping/BCom Accounting Retail Business Analyst Applications must be accompanied by the following documents: An updated CV (with contact details etc.); A certified copy of the W&RSETA NQF 2, 3, 4 or 5 certificate; A certified copy of their Matric certificate or equivalent qualification; A completed application form All applications must reach the W&RSETA on or before the closing date. Information about this specific bursary programme can be obtained from Elizabeth Maila at W&RSETA Head Office on 012 622 9500 or use our free SMS line on 30909 with your details for the W&RSETA to contact you. All Applications must be posted to Private Bag X106, Centurion, 0046 or submitted to the nearest regional office. If you do not receive any correspondence from the W&RSETA by 31st January 2014, please regard your application as unsuccessful. var uri = 'http://imp.tradedoubler.com/imp?type(img)g(20282126)a(2327322)' + new String (Math.random()).substring (2, 11); document.write('<a href=\"http://clk.tradedoubler.com/click?p=217168&#038;a=2327322&#038;g=20282126\" target=\"_BLANK\"><img decoding=\"async\" src=\"'+uri+'\" border=0></a>'); Umthombo Resources: Bursaries 2014 CLOSING DATE: 31 January 2014 Umthombo Resources invites students who are interested in joining the Mining Industry to apply for our External Bursary Scheme in the study fields mentioned below: B Sc Electrical Engineering B Sc Mechanical Engineering B Sc Mine Survey B Sc Geology B Sc Analytical Chemistry In making the final selection, first preference will be given to: Previously disadvantaged individuals from the Middelburg and Delmas area Financially disadvantaged Currently registered at a recognised University People with disabilities and females South African Citizens Bursaries are available to South African citizens who already studying with a 65% average at a tertiary institution. Bursary covers full tuition, accommodations and book allowances. How to Apply Download Applications form and the following documentation must accompany the application form: Certified ID Copy, Certified matric results, certified copies of tertiary academic records including most recent results, certified copies of 2013 Proof of registration and fee statement. Completed forms with certified copies of attachments should be e-mailed back to admin@umthombo.co.za. Should you not receive correspondence from Umthombo Resources within 30 days from the closing date, please accept that your application has been unsuccessful. // <![CDATA[ google_ad_client = \"ca-pub-9880737424968860\"; /* Youth Village SA Leaderboard */ google_ad_slot = \"8551205544\"; google_ad_width = 728; google_ad_height = 90; // ]]&gt; // <![CDATA[ // ]]&gt; Fluor: Engineering Bursary Programme 2014 Closing Date: 22 November 2013 Fluor Says: If you have been provisionally accepted for a 2014 or are currently studying towards an engineering degree or degree in built environment, at a South African university, we would like to hear from you. Selection Criteria academic results financial need and commitment ability and potential to follow in an engineering career at Fluor How to Apply Apply by sending an email to henny.moraka@fluor.com. Attach a certified copy of your last academic results (school or university), a motivation as to why you have chosen a career in the field of study you have registered for, your CV and copy of your acceptance letter (provisional). Type “Bursary” in the subject like and email your CV no later than the closing date. If you have not heard from us by the 13th of December 2013, please be advised that your application has not been successful. var uri = 'http://imp.tradedoubler.com/imp?type(img)g(21517850)a(2327322)' + new String (Math.random()).substring (2, 11); document.write('<a href=\"http://clk.tradedoubler.com/click?p=242805&#038;a=2327322&#038;g=21517850\" target=\"_BLANK\"><img decoding=\"async\" src=\"'+uri+'\" border=0></a>'); De Beers: Bursaries 2014 Closing Date: 30 November 2013 De Beers will be awarding a limited number of bursaries in 2014 and is inviting un-bonded students studying at University or Universities of Technology to apply for bursaries available in the following disciplines: Electrical Engineering (heavy current) 2nd or 3rd year students Metallurgy/Chemical Engineering 2nd or 3rd year students Mining 2nd or 3rd year students Entry requirements : Grade 12 with a minimum “C” symbol in both Mathematics and Science on Higher Grade; Already enrolled in the required field of study; Un-bonded students. Additional information: The Bursary has a Contractual Employment obligation. Students are responsible for their own registration for 2014. How to Apply Interested / Qualifying Students should send us:- a CV; a complete and up-to-date Academic Record; Matric Certificate; For the attention of Sue van Zyl : e-mail sue.vanzyl@debeersgroup.com Please note: Preference will be given to students from the Free State, Northern Cape and Limpopo Provinces. // <![CDATA[ // ]]&gt; Afrox: Bursary Programme 2014 You have excelled in your first academic year. You are a well-balanced individual seeking to obtain a bursary in the fields of: Mechanical Engineering Industrial Engineering Metallurgical Engineering Chemical Engineering Minimum Requirements Criteria and Benefits An average pass mark of 60% in the chosen field of study Preference will be given to individuals from previously disadvantaged groups you will receive a monthly stipend An allowance for the Vacation work Specification As a company that employs high calibre staff, we want to attract people who can contribute towards our drive to make Afrox a world-class company. Afrox, a Linde Group company, manages a bursary scheme. Bursary recruitment is in line with the company’s needs. The bursary covers university fees, books, residence fees (including catering and laundry). A bursary is valid for one year only. Subject to academic success and performance during vacation work in Afrox, the “Young Talent Development Committee”, may renew your bursary and contract for another year. This process will continue until you graduate. You are required to do vacation work in Afrox during June/July and December/January university breaks. A line manager will conduct a formal performance appraisal at the end of both vacation work periods. You, in turn, will compile a presentation based on a project you will have completed during the work period. You will present it to the “Young Talent Development Committee”. Preference is given to applicants from previously disadvantaged groups. We constantly seek and develop the best talent to help us remain at the cutting edge PLEASE NOTE: Afrox is committed to Employment Equity and the development of youth. Candidates with disabilities are welcome to apply. Only South African Citizens may apply. How to Apply Apply Online var uri = 'http://imp.tradedoubler.com/imp?type(img)g(21118256)a(2327322)' + new String (Math.random()).substring (2, 11); document.write('<a href=\"http://clk.tradedoubler.com/click?p=216274&#038;a=2327322&#038;g=21118256\" target=\"_BLANK\"><img decoding=\"async\" src=\"'+uri+'\" border=0></a>'); WC Government Medical & Healthcare: Bursaries 2014 The aim of the bursary is to attract qualified persons with the required competencies, knowledge and skills to join the Department to meets its service delivery needs. In 2006 academic year, for example, the following bursaries per health science study field were awarded: Nursing Medical (MBChB) Pharmacy Radiography Emergency Medical Care Please note more health science study fields may be added per academic year based on Departmental service delivery needs. What does the Bursary Cover? Tuition (Actual study fees), registration and examination fees. If you fail an academic year, you will have to repeat that year at your own cost, after which the bursary will be reinstated for the following academic year, if you pass. Will I have to Pay or Work Anything Back? The bursaries are awarded on a work-back system – on a year for a year basis. Community Service Year will count towards the student’s 1st year of bursary obligation, although internship years will not. Students may start paying, that is working, back their bursary obligation as soon as they have successfully completed their studies Who Can Apply for a Bursary? To apply for one of these bursaries you must be: A South African citizen or permanent resident A resident of the Western Cape Able to prove financial need Ideally from a historically disadvantaged background Be accepted at the relevant accredited HEI Bursars’ obligations: bursars are expected to furnish the department with satisfactory proof of registration at an accredited academic institution at the start of the financial year. He or she is also expected to submit all annual or supplementary examination results to the department within 30 days of receiving such results. How do I Apply Apply directly to the Department of Health. Invitations to apply will run in local newspapers. Your university or university of technology’s bursaries office should be able to supply you with an application form. Alternatively, contact the Department of Health on the numbers below. // <![CDATA[ var uri = 'http://imp.tradedoubler.com/imp?type(js)pool(508278)a(2327322)' + new String (Math.random()).substring (2, 11); document.write('<sc'+'ript type=\"text/javascript\" src=\"'+uri+'\" charset=\"ISO-8859-1\"></sc'+'ript>'); // ]]&gt;",
    "type": "bursary",
    "url": "https://youthvillage.co.za/",
    "source": "Youth Village",
    "posted": "2025-10-25T11:39:42.113Z",
    "deadline": null,
    "requirements": [],
    "salary": "Bursary/Scholarship",
    "created": "2025-10-25T11:39:42.113Z"
  },
  {
    "id": "most-bursary-and-scholarship-applications-close-on-30-september-with-a-few-exceptions-noted-on-specific-bursary-pages-due-to-high-traffic-server-issues-may-occur-to-accommodate-this-applicants-will-have-one-extra-day-to-complete-their-applications-after-the-closing-date-various-studytrust",
    "title": "Most bursary and scholarship applications close on 30 September, with a few exceptions noted on specific bursary pages. Due to high traffic, server issues may occur. To accommodate this, applicants will have one extra day to complete their applications after the closing date.",
    "company": "Various Companies",
    "location": "South Africa",
    "description": "StudyTrust-administered Bursaries and Scholarships",
    "type": "bursary",
    "url": "https://www.studytrust.org.za/amazon-recruitment-bursaries/",
    "source": "Study Trust",
    "posted": "2025-10-25T11:39:49.620Z",
    "deadline": null,
    "requirements": [],
    "salary": "Bursary/Scholarship",
    "created": "2025-10-25T11:39:49.620Z"
  }
]