[
  {
    "id": "learnerships-2015-at-id-logistics-south-africa-various-youthvillage",
    "title": "Learnerships 2015 at ID Logistics South Africa",
    "company": "Various Companies",
    "location": "South Africa",
    "description": "(adsbygoogle = window.adsbygoogle || []).push({}); The ID Logistics is offering the Latest Learnership Programme 2015 in Boksburg, South Africa. The ID Logistics Learnerships 2015 can jump start your career, and you will earn good revenue during the 2015 Learnership Programme. The ID Logistics is one of the famous South African Companies, and it can raise your experience level by engaging you under the team of their veterans. The ID Logistics Jobs and Career Offers mostly remain available / vacant. You may also avail these Jobs at ID Logistics, South Africa after completing your Learnership Programme 2015. It is also worth mentioning here that after completing the ID Logistics Learnership Programme 2015, you may get more better Career Opportunities and Jobs in South Africa. If you are interested in the ID Logistics Learnerships for 2015, you should have a look on the details and descriptions of the Available Learnerships at ID Logistics before forwarding your job application to n recruitment department of the company. ID Logistics Learnerships 2015 in South Africa: ID Logistics Careers ID Logistics are currently searching for a suitable candidate for a Learnership Programme for the next twelve months. The candidate will be based at their Boksburg Site. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1759741198652-0'); }); Responsibilities Count stock for a stock -take Define the core concept of the wholesale and retail environment Move, pack and maintain stock in a distribution centre / warehouse Pick stock in a distribution centre warehouse Maintain time and work processes within a business environment Dispatch stock from a distribution centre Receive stock in a DC / Warehouse Resolve customer queries / complains Communication, and Mathematical literacy Requirements Matric Willingness to learn Ability to communicate well Willingness to work shift How to Apply for ID Logistics Learnership Programme 2015: ID Logistics Jobs in South Africa ID logistics is offering the 12 Months Learnership Programme in 2015 for those candidates, who are willing to get experience in the above mentioned fields. If you meet the minimum eligibility criteria, you should Click here to apply online for the Latest Learnerships 2015 at ID Logistics South Africa. The Learnership Opportunity will best suit to you needs, as you will get more better Jobs and Career offers in near future after the successful completion of Learnership Programme 2015. Hence you should not waste your time, and try your luck at ID Logistics by forwarding your job application at the earliest possible time. <!-- e9 = new Object(); e9.size = \"320x50\"; //--> window._taboola = window._taboola || []; _taboola.push({ mode: 'alternating-thumbnails-a', container: 'taboola-below-article-thumbnails', placement: 'Below Article Thumbnails', target_type: 'mix' }); TagsLearnerships",
    "type": "learnership",
    "url": "https://youthvillage.co.za/",
    "source": "Youth Village",
    "posted": "2025-10-25T11:27:38.150Z",
    "deadline": null,
    "requirements": [],
    "salary": "Stipend/Training",
    "created": "2025-10-25T11:27:38.150Z"
  }
]